spec/fixtures/vcr_casettes/credit/invalid.yml

---
http_interactions:
- request:
    method: post
    uri: https://global-api-sandbox.afterpay.com/v2/payments/INVALID_RESPONSE_CODE/refund
    body:
      encoding: UTF-8
      string: '{"requestId":null,"merchantReference":null,"refundMerchantReference":null,"amount":{"amount":"10.0","currency":"USD"}}'
    headers:
      User-Agent:
      - SolidusAfterpay/0.0.1 (Solidus/3.0.1; Ruby/2.6.6; Merchant/100101481) https://
      Authorization:
      - Basic <ENCODED_AUTH_HEADER>
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 404
      message: Not Found
    headers:
      Date:
      - Wed, 25 Aug 2021 14:56:01 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Http-Correlation-Id:
      - niezt4yj2dkazwuaxcylyctiia
      X-Envoy-Upstream-Service-Time:
      - '5'
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Set-Cookie:
      - __cf_bm=81e813f9b6a9b6041a3d539ff719c1362dbee0d7-1629903361-1800-AVFdNDg4AQvJHpdIrmZWTC4rShEPzouH1zIL4mzM59aQ+YuVenlK7OdUtpsPgycODEOuYbUcqh368D3EFoYFQLmPl8XrO0VfJz5ZC/d+lxpP;
        path=/; expires=Wed, 25-Aug-21 15:26:01 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 6845aa2a69d4cd26-FCO
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "errorCode" : "not_found",
          "errorId" : "c7585eb6f53f5af5",
          "message" : "Afterpay payment ID not found.",
          "httpStatusCode" : 404
        }
  recorded_at: Wed, 25 Aug 2021 14:56:01 GMT
recorded_with: VCR 6.0.0
